InformationRegisters/НастройкиПрямыхВыплатФСССотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПрямыхВыплатФСССотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОпределятьПоОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОпределятьПоОсновномуМестуРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СпособыПрямыхВыплатФСС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКОсобойЗоне</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКОсобойЗоне</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОсобойЗоныПроживанияРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсобойЗоныПроживанияРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПрямыхВыплатФСССотрудниковПодробности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПрямыхВыплатФСССотрудниковПодробности</Name>
			<Comment>Подробные сведения о способе прямых выплат выплат сотрудника (используются для отображения в списке)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СпособыПрямыхВыплатФСС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПрямыхВыплатФСССотрудников/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Команда = Метаданные.РегистрыСведений.НастройкиПрямыхВыплатФСССотрудников.Команды.ФормаСписка;
	НавигационнаяСсылка = "e1cib/command/" + Команда.ПолноеИмя();
	Заголовок           = Команда.Представление();
	
	Список.Параметры.УстановитьЗначениеПараметра("МаксимальноеНачалоДня", '39991231000000');
	Список.Параметры.УстановитьЗначениеПараметра("ВнутреннееСовместительство", Перечисления.ВидыЗанятости.ВнутреннееСовместительство);
	Список.Параметры.УстановитьЗначениеПараметра("Подработка", Перечисления.ВидыЗанятости.Подработка);
	Список.Параметры.УстановитьЗначениеПараметра("ПустойВидЗанятости", Перечисления.ВидыЗанятости.ПустаяСсылка());
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	Организация   = Параметры.Организация;
	ФильтрПодразделение = Параметры.Подразделение;
	
	АдаптироватьКВыборуТипов();
	
	Элементы.КартинкаИдетРасчетСпособовВыплаты.Видимость = Ложь;
	Если Не ОбщегоНазначенияБЗК.ЕстьСохраненныеНастройкиФормы(ЭтотОбъект) Тогда
		ПослеЗагрузкиВсехНастроекФормыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	Если ЗначениеЗаполнено(Организация) Тогда
		Настройки.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПослеЗагрузкиВсехНастроекФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОжидатьЗавершенияРасчетаПодробностей();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НастройкиПрямыхВыплатФСССотрудников"
		Или ИмяСобытия = "Запись_НастройкиПрямыхВыплатФСССотрудниковПодробности" Тогда
		
		Элементы.Список.Обновить();
		
	Иначе
		
		ЭлектронныйДокументооборотСФССКлиент.ОбработатьОповещенияИнформационнойПанелиБРО(
			ЭтотОбъект, ИмяСобытия, Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
	ОжидатьЗавершенияРасчетаПодробностей();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПодразделениеПриИзменении(Элемент)
	ИспользоватьФильтрПодразделение = ЗначениеЗаполнено(ФильтрПодразделение);
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФильтрПодразделениеПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФильтрСпособПрямыхВыплатПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТипаСпособаПриИзменении(Элемент)
	ИспользоватьФильтрТипСпособа = ЗначениеЗаполнено(ФильтрТипаСпособа);
	ОбновитьФорму();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(ТаблицаФормы, ИдентификаторСтроки, ПолеФормы, СтандартнаяОбработка)
	Если ИдентификаторСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяСтрока = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Если ПолеФормы = Элементы.СписокСотрудник Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Сотрудник);
	ИначеЕсли ПолеФормы = Элементы.СписокФизическоеЛицо Тогда
		ПоказатьЗначение(, ТекущаяСтрока.ФизическоеЛицо);
	Иначе
		УчетПособийСоциальногоСтрахованияКлиент.НастроитьСпособПрямыхВыплатФизическогоЛица(
			ТекущаяСтрока.ГоловнаяОрганизация,
			ТекущаяСтрока.ФизическоеЛицо,
			ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьСпособыОпределяемыеАвтоматически(Команда)
	НачатьРасчетПодробностей();
	ОжидатьЗавершенияРасчетаПодробностей();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОрганизации(Команда)
	УчетПособийСоциальногоСтрахованияКлиент.ОткрытьНастройкиПрямыхВыплатОрганизации(
		Организация,
		ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область РасширениеСобытийФормы

&НаСервере
Процедура ПослеЗагрузкиВсехНастроекФормыНаСервере()
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ЗначенияДляЗаполнения = Новый Структура("Организация", "Организация");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	КонецЕсли;
	ОбновитьФорму(Истина);
КонецПроцедуры

#КонецОбласти

#Область ИнформационнаяПанельБРО

&НаСервере
Процедура ОбновитьИнформационнуюПанельБРО()
	СЭДОФСС.ОбновитьИнформационнуюПанельБРО(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельБРООбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ЭлектронныйДокументооборотСФССКлиент.ИнформационнаяПанельБРОНажатие(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьФорму(Знач НачатьРасчетПодробностей = Ложь)
	
	ОбновитьИнформационнуюПанельБРО();
	
	ОбновитьПараметрыСписка();
	Элементы.Список.Обновить();
	
	Если НачатьРасчетПодробностей Тогда
		НачатьРасчетПодробностей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьКВыборуТипов()
	// В запросе в полях "Способ" и "РассчитанныйСпособ" используются представления типов т.к.:
	//   ТИПЗНАЧЕНИЯ(Настройки.Значение) не удалось использовать в запросе на платформе 8.3.14.1976,
	//     поскольку тип некорректно передается в запрос и не работает отбор по типу;
	//   Имя типа также не удалось использовать в запросе,
	//     поскольку тогда представление типа необходимо задавать условным оформлением списка,
	//     а при таком варианте не работает поиск по Ctrl+F.
	
	ТекстыВыбораТипа1 = Новый Массив;
	ШаблонВыбораТипа1 = "КОГДА Настройки.Значение ССЫЛКА %1 И Настройки.Значение <> ЗНАЧЕНИЕ(%1.ПустаяСсылка) ТОГДА ""%2""";
	
	ТекстыВыбораТипа2 = Новый Массив;
	ТекстыВыбораТипа2.Добавить("");
	ТекстыВыбораТипа2.Добавить("ВЫБОР");
	ШаблонВыбораТипа2 = "КОГДА ПодробностиНастроек.Значение ССЫЛКА %1 ТОГДА ""%2""";
	
	СпособОпределятьАвтоматически = СпособОпределятьАвтоматически();
	ТипыСпособовПрямыхВыплат = СпособыПрямыхВыплатФСС.ТипыСпособовПрямыхВыплат();
	Элементы.ФильтрТипаСпособа.СписокВыбора.Добавить(СпособОпределятьАвтоматически, СпособОпределятьАвтоматически);
	ПустыеЗначения = Новый Массив;
	ПустыеЗначения.Добавить(Неопределено);
	Для Каждого СтрокаТаблицы Из ТипыСпособовПрямыхВыплат Цикл
		Элементы.ФильтрТипаСпособа.СписокВыбора.Добавить(СтрокаТаблицы.Заголовок, СтрокаТаблицы.Заголовок);
		ОписаниеТипов = Новый ОписаниеТипов(СтрокаТаблицы.ИмяТипа);
		ПустыеЗначения.Добавить(ОписаниеТипов.ПривестиЗначение(Неопределено));
		ПолноеИмя = Метаданные.НайтиПоТипу(СтрокаТаблицы.Тип).ПолноеИмя();
		ТекстыВыбораТипа1.Добавить(СтрШаблон(ШаблонВыбораТипа1, ПолноеИмя, СтрокаТаблицы.Заголовок));
		ТекстыВыбораТипа2.Добавить(СтрШаблон(ШаблонВыбораТипа2, ПолноеИмя, СтрокаТаблицы.Заголовок));
	КонецЦикла;
	Список.Параметры.УстановитьЗначениеПараметра("ПустыеЗначения", ПустыеЗначения);
	
	ТекстыВыбораТипа1.Добавить("ИНАЧЕ """"");
	ТекстыВыбораТипа2.Добавить("ИНАЧЕ """"");
	ТекстыВыбораТипа2.Добавить("КОНЕЦ");
	ФрагментЗапроса1 = СтрСоединить(ТекстыВыбораТипа1, Символы.ПС + Символы.Таб + Символы.Таб);
	ФрагментЗапроса2 = СтрСоединить(ТекстыВыбораТипа2, Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб);
	ТекстЗапроса = Список.ТекстЗапроса;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СпособОпределятьАвтоматически", СпособОпределятьАвтоматически);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИНАЧЕ ВЫРАЗИТЬ(""&ФрагментЗапроса1"" КАК СТРОКА(100))", ФрагментЗапроса1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """&ФрагментЗапроса2""", ФрагментЗапроса2);
	Список.ТекстЗапроса = ТекстЗапроса;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СпособОпределятьАвтоматически()
	Возврат НСтр("ru = 'Определять автоматически'");
КонецФункции

&НаСервере
Процедура ОбновитьПараметрыСписка()
	
	Если ЗначениеЗаполнено(ФильтрПодразделение)
		И ИспользоватьФильтрПодразделение
		И Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФильтрПодразделение, "Владелец");
	КонецЕсли;
	
	Элементы.СписокОрганизация.Видимость = Не ЗначениеЗаполнено(Организация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Организация",
		Организация,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Организация),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ВидСравненияПодразделения = ?(ТипЗнч(ФильтрПодразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций"),
		ВидСравненияКомпоновкиДанных.ВИерархии,
		ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Подразделение",
		ФильтрПодразделение,
		ВидСравненияПодразделения,
		,
		ИспользоватьФильтрПодразделение,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	Если ФильтрТипаСпособа = СпособОпределятьАвтоматически() Тогда
		ОтборСпособИспользование = ИспользоватьФильтрТипСпособа;
		ОтборРассчитанныйСпособИспользование = Ложь;
	Иначе
		ОтборСпособИспользование = Ложь;
		ОтборРассчитанныйСпособИспользование = ИспользоватьФильтрТипСпособа И ЗначениеЗаполнено(ФильтрТипаСпособа);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Способ",
		СпособОпределятьАвтоматически(),
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ОтборСпособИспользование,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"РассчитанныйСпособ",
		ФильтрТипаСпособа,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ОтборРассчитанныйСпособИспользование,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ОбновитьФорму(ЗначениеЗаполнено(Организация));
КонецПроцедуры

#Область ДлительнаяОперация

&НаСервере
Процедура НачатьРасчетПодробностей()
	Если ДлительнаяОперация <> Неопределено И ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ДлительнаяОперация.ИдентификаторЗадания);
	КонецЕсли;
	
	ИмяМетода = "РегистрыСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.РассчитатьСпособыОпределяемыеАвтоматически";
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Пособия СФР: Расчет способов прямых выплат'");
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(НастройкиЗапуска, ИмяМетода, Организация);
	
	Элементы.КартинкаИдетРасчетСпособовВыплаты.Видимость = (ДлительнаяОперация <> Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершенияРасчетаПодробностей()
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("ПослеЗавершенияРасчетаПодробностейКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРасчетаПодробностейКлиент(Задание, ДополнительныеПараметры) Экспорт
	// Задание - Неопределено - Если задание было отменено;
	//         - Структура - Результат выполнения фонового задания:
	//   * Статус - Строка - "Выполнено", если задание завершено успешно; "Ошибка", если возникло исключение.
	//   * АдресРезультата - Строка - адрес временного хранилища, в которое помещен результат работы процедуры.
	//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат,
	//       содержит адрес дополнительного временного хранилища, в которое помещен результат работы процедуры.
	//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
	//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
	//   * Сообщения - Неопределено, ФиксированныйМассив из СообщениеПользователю
	ДлительнаяОперация = Неопределено;
	Элементы.КартинкаИдетРасчетСпособовВыплаты.Видимость = Ложь;
	Оповестить("Запись_НастройкиПрямыхВыплатФСССотрудниковПодробности", Неопределено, ЭтотОбъект);
	Если Задание <> Неопределено И ЗначениеЗаполнено(Задание.КраткоеПредставлениеОшибки) Тогда
		ИнформированиеПользователяКлиент.Предупредить(Задание.КраткоеПредставлениеОшибки, Задание.ПодробноеПредставлениеОшибки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
